In [1]:
# Import required libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [4]:
# Load dataset
flights = pd.read_csv('data/flights_dirty.csv')

In [5]:
# Check the top of DataFrame
flights.head()

   year month  passengers
0  1949  jan   114.388770
1  1949   Feb  116.704857
2  1949   Mar  129.126454
3  1949  Apr   126.892509
4  1949   May  122.699105

In [6]:
# Check the bottom of DataFrame
flights.tail()

     year month  passengers
149  1955   Feb  224.654338
150  1950   Jul  166.140905
151  1958   Oct  367.306509
152  1955   Jul  362.328765
153  1955   May  268.410765

> The `passengers` column is `float` instead of an `int` data type
>
> Inconsistency in the string format in the `month` column

In [8]:
# Check the summary information
flights.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 154 entries, 0 to 153
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   year        154 non-null    object
 1   month       154 non-null    object
 2   passengers  136 non-null    float64
dtypes: float64(1), object(2)
memory usage: 3.7+ KB

In [9]:
# Check the descriptive statistics
flights.describe()

        passengers
count   136.000000
mean    299.633655
std     171.510392
min     -15.748963
25%     189.203060
50%     275.432094
75%     366.067432
max    1503.245434

In [10]:
flights.describe(include='O')

        year month
count    154   154
unique    13    32
top     1955   Feb
freq      16    14